const projects = [
  {
    title:
      "Проект: Описание задачи далеко-далеко за словесными горами в стране  гласных и согласных живут рыбные тексты. Вдали от всех живут  они в буквенных домах на берегу Семантика большого языковогоокеана. Маленький ручеек Даль журчит по всей стране иобеспечивает ее всеми необходимыми правилами",
    projectCode: "22398742#12345",
    create: "Климов-Петров И.И. создал(а) 17 сен 2022 в 13:55",
    update: "Иванов В.В. изменил(а) 1 минуту назад",
  },
  {
    title: "Название проекта",
    projectCode: "22398742#1234545637458273658972635872635876245786",
    create: "Петров И.И. создал(а) 17 сен 2022 в 13:55",
    update: "Иванов В.В. изменил(а) 1 минуту назад",
  },
];

export default projects;
