import avatar from "@/assets/images/avatar.png";

const tasks = [
  {
    title:
      "Задача: Описание задачи далеко-далеко за словесными горами в стране  гласных и согласных живут рыбные тексты. Вдали от всех живут  они в буквенных домах на берегу Семантика большого языковогоокеана. Маленький ручеек Даль журчит по всей стране иобеспечивает ее всеми необходимыми правилами",
    projectCode:
      "22398742#2653137653251836235432452513163168242748724298742287987322398742#12345678987654321",
    create: "Петров-Суздальский И.И. создал(а) 17 сен 2022 в 13:55",
    update: "Иванов-Старообрядцев В.В. изменил(а) 1 минуту назад",
    avatar: avatar,
  },
  {
    title: "Название задачи",
    projectCode: "22398742#26531376532518362354324",
    create: "Петров И.И. создал(а) 17 сен 2022 в 13:55",
    update: "Иванов-Старообрядцев В.В. изменил(а) 1 минуту назад",
    avatar: avatar,
  },
];

export default tasks;
